SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/mongodb/0-Algemeen_Big_Data_Reeks1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-21 Wed 11:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Oefeningen MongoDB - Oefeningen Algemeen Big Data Reeks1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Robin Wils" />
<link rel="stylesheet" type="text/css" href="../solarized-dark.min.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Oefeningen MongoDB - Oefeningen Algemeen Big Data Reeks1</h1>
<hr />
<p>
<a href="../index.html">Home</a> &gt; <a href="mongodb.html">MongoDB</a> &gt; Algemene oefeningen <br />
<a href="https://pxl-college-projects.gitlab.io/big-data-exercises-pxl.gitlab.io/mongodb/0-Algemeen_Big_Data_Reeks1.org">View org source</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2497daf">Opgave 1</a></li>
<li><a href="#org8998a7d">Opgave 2</a></li>
<li><a href="#org8b92a87">Opgave 3</a></li>
<li><a href="#orge72794d">Opgave 4</a></li>
<li><a href="#orgeed6a43">Opgave 5</a></li>
<li><a href="#orgb9fa325">Opgave 6</a></li>
<li><a href="#org7a72ef1">Opgave 7</a></li>
<li><a href="#org20768a6">Opgave 8</a></li>
<li><a href="#orgf40e241">Opgave 9</a></li>
<li><a href="#org94e3091">Opgave 10</a></li>
<li><a href="#org11959a0">Opgave 11</a></li>
<li><a href="#orgdf745f4">Opgave 12</a></li>
<li><a href="#org1763b66">Opgave 13</a></li>
<li><a href="#org2b19f4b">Opgave 14</a></li>
<li><a href="#org38f51d4">Opgave 15</a></li>
<li><a href="#org0d97002">Opgave 16</a></li>
<li><a href="#orgcee5029">Opgave 17</a></li>
<li><a href="#org832e4ad">Opgave 18</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2497daf" class="outline-2">
<h2 id="org2497daf">Opgave 1</h2>
<div class="outline-text-2" id="text-org2497daf">
<p>
Maak een databank '1TINdb' aan.
</p>

<div class="org-src-container">
<pre class="src src-mongo">use 1TINdb
</pre>
</div>
</div>
</div>

<div id="outline-container-org8998a7d" class="outline-2">
<h2 id="org8998a7d">Opgave 2</h2>
<div class="outline-text-2" id="text-org8998a7d">
<p>
Toon alle databanken. <br />
Waarom wordt '1TINdb' nog niet getoond?
</p>

<p>
<i>MongoDB gebruikt momenteel een ongemaakte databank.</i>
<i>De databank wordt pas gecreëerd wanneer je iets opslaagt.</i>
<i>Deze ongemaakte databank wordt aangemaakt wanneer je iets in de databank
steekt.</i>
</p>
</div>
</div>

<div id="outline-container-org8b92a87" class="outline-2">
<h2 id="org8b92a87">Opgave 3</h2>
<div class="outline-text-2" id="text-org8b92a87">
<p>
Geef het commando om te tonen wat je huidige databank is.
</p>

<div class="org-src-container">
<pre class="src src-mongo">db
</pre>
</div>
</div>
</div>

<div id="outline-container-orge72794d" class="outline-2">
<h2 id="orge72794d">Opgave 4</h2>
<div class="outline-text-2" id="text-orge72794d">
<p>
Maak een collectie studentenregatta.
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.createCollection(<span style="color: #528B8B;">"studentenregatta"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeed6a43" class="outline-2">
<h2 id="orgeed6a43">Opgave 5</h2>
<div class="outline-text-2" id="text-orgeed6a43">
<p>
Voer dit document in en zorg ervoor dat _id als tekst wordt geregistreerd. <br />
Waarom is dit nodig? 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">_id:</td>
<td class="org-right">001</td>
</tr>

<tr>
<td class="org-left">team:</td>
<td class="org-right">PXL</td>
</tr>

<tr>
<td class="org-left">aantal_likes:</td>
<td class="org-right">820</td>
</tr>

<tr>
<td class="org-left">teamleden:</td>
<td class="org-right">9</td>
</tr>
</tbody>
</table>

<p>
Je kan telkens de inhoud van je collection opvragen door: <br />
db.collectienaam.find() <br />
Doe dit na elke instructie om je resultaat te controleren! 
</p>

<p>
<i>MongoDB gebruikt '_id' als een hexadecimaal uniek nummer in elke collectie 
voor elk document tenzij we het zelf in onze collectie steken.</i>
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.studentenregatta.insertOne({
  <span style="color: #528B8B;">"_id"</span> : <span style="color: #528B8B;">"001"</span>,
  <span style="color: #528B8B;">"team"</span>: <span style="color: #528B8B;">"PXL"</span>,
  <span style="color: #528B8B;">"aantal_likes"</span>: <span style="color: #528B8B;">"820"</span>,  
  <span style="color: #528B8B;">"teamleden"</span>: <span style="color: #528B8B;">"9"</span>
})
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb9fa325" class="outline-2">
<h2 id="orgb9fa325">Opgave 6</h2>
<div class="outline-text-2" id="text-orgb9fa325">
<p>
Voeg via 1 instructie 2 documenten toe:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">_id:</td>
<td class="org-right">002</td>
</tr>

<tr>
<td class="org-left">team:</td>
<td class="org-right">UCLL</td>
</tr>

<tr>
<td class="org-left">teamleden:</td>
<td class="org-right">8</td>
</tr>
</tbody>
</table>

<p>
<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">_id:</td>
<td class="org-right">003</td>
</tr>

<tr>
<td class="org-left">team:</td>
<td class="org-right">Uhasselt</td>
</tr>

<tr>
<td class="org-left">aantal_likes:</td>
<td class="org-right">400</td>
</tr>
</tbody>
</table>

<p>
Merk op dat de 3 documenten in de collectie studentenregatta een verschillende 
structuur hebben.
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.studentenregatta.insertMany([
  {<span style="color: #528B8B;">"_id"</span> : <span style="color: #528B8B;">"002"</span>, <span style="color: #528B8B;">"team"</span>: <span style="color: #528B8B;">"UCLL"</span>, <span style="color: #528B8B;">"teamleden"</span>: <span style="color: #528B8B;">"8"</span>},
  {<span style="color: #528B8B;">"_id"</span> : <span style="color: #528B8B;">"003"</span>, <span style="color: #528B8B;">"team"</span>: <span style="color: #528B8B;">"Uhasselt"</span>, <span style="color: #528B8B;">"aantal_likes"</span>: <span style="color: #528B8B;">"400"</span>}
])
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a72ef1" class="outline-2">
<h2 id="org7a72ef1">Opgave 7</h2>
<div class="outline-text-2" id="text-org7a72ef1">
<p>
Vervang in de collectie studentenregatta de naam van het team PXL door 
'Hogeschool PXL'.
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.studentenregatta.update(
  {<span style="color: #528B8B;">"team"</span>: <span style="color: #528B8B;">"PXL"</span>}, 
  {<span style="color: #528B8B;">"team"</span>: <span style="color: #528B8B;">"Hogeschool PXL"</span>}
)
</pre>
</div>
</div>
</div>

<div id="outline-container-org20768a6" class="outline-2">
<h2 id="org20768a6">Opgave 8</h2>
<div class="outline-text-2" id="text-org20768a6">
<p>
Wijzig het document van het team Hogeschool PXL. <br />
Voeg het volgende subdocument toe:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">supporters:</td>
<td class="org-left">personeel: 50</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">studenten: 150</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-mongo">db.studentenregatta.insertOne({
  <span style="color: #528B8B;">"supporters"</span>: {
    <span style="color: #528B8B;">"personeel"</span>: 50,
    <span style="color: #528B8B;">"studenten"</span>: 150
  }
})
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf40e241" class="outline-2">
<h2 id="orgf40e241">Opgave 9</h2>
<div class="outline-text-2" id="text-orgf40e241">
<p>
Verwijder de collectie studentenregatta.
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.studentenregatta.drop()
</pre>
</div>
</div>
</div>

<div id="outline-container-org94e3091" class="outline-2">
<h2 id="org94e3091">Opgave 10</h2>
<div class="outline-text-2" id="text-org94e3091">
<p>
Voeg met 1 instructie in een nieuwe collectie films dit document toe: 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">naam:</td>
<td class="org-right">Iedereen beroemd</td>
</tr>

<tr>
<td class="org-left">jaar:</td>
<td class="org-right">2000</td>
</tr>
</tbody>
</table>

<p>
Werd er een veld toegevoegd? <br />
<i>Ja, de gevraagde collectie en een _id veld werd toegevoegd.</i>
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.films.insertOne({
  <span style="color: #528B8B;">"naam"</span>: <span style="color: #528B8B;">"Iedereen beroemd"</span>,
  <span style="color: #528B8B;">"jaar"</span>: 2000
})
</pre>
</div>
</div>
</div>

<div id="outline-container-org11959a0" class="outline-2">
<h2 id="org11959a0">Opgave 11</h2>
<div class="outline-text-2" id="text-org11959a0">
<p>
Wijzig het document van de film Iedereen beroemd. <br />
Voeg de volgende kenmerken toe: <br />
acteurs: Josse De Pauw, Eva Van Der Gucht, Werner De Smedt
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.films.update(
  {<span style="color: #528B8B;">"naam"</span>: <span style="color: #528B8B;">"Iedereen beroemd"</span>},
  {$addToSet: {<span style="color: #528B8B;">"acteurs"</span>: {
    $each: [<span style="color: #528B8B;">"Josse De Pauw"</span>,<span style="color: #528B8B;">"Eva Van Der Gucht"</span>, <span style="color: #528B8B;">"Werner De Smedt"</span>]
  }}}
)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf745f4" class="outline-2">
<h2 id="orgdf745f4">Opgave 12</h2>
<div class="outline-text-2" id="text-orgdf745f4">
<p>
Voeg het volgende document toe aan de collectie films:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">naam:</td>
<td class="org-left">Loft</td>
</tr>

<tr>
<td class="org-left">jaar:</td>
<td class="org-left">2008</td>
</tr>

<tr>
<td class="org-left">acteurs:</td>
<td class="org-left">Koen De Bouw, Filip Peeters</td>
</tr>

<tr>
<td class="org-left">director:</td>
<td class="org-left">Erik Van Looy</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-mongo">db.films.insertOne({
  <span style="color: #528B8B;">"naam"</span> : <span style="color: #528B8B;">"Loft"</span>, 
  <span style="color: #528B8B;">"jaar"</span>: 2008, 
  <span style="color: #528B8B;">"acteurs"</span>: [<span style="color: #528B8B;">"Koen De Bouw"</span>, <span style="color: #528B8B;">"Filip Peeters"</span>],
  <span style="color: #528B8B;">"director"</span>: <span style="color: #528B8B;">"Erik Van Looy"</span>
})
</pre>
</div>
</div>
</div>

<div id="outline-container-org1763b66" class="outline-2">
<h2 id="org1763b66">Opgave 13</h2>
<div class="outline-text-2" id="text-org1763b66">
<p>
Voeg nog een acteur toe aan de film Loft: <br />
Matthias Schoenaerts
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.films.update(
  {<span style="color: #528B8B;">"naam"</span>: <span style="color: #528B8B;">"Loft"</span>}, 
  {$addToSet: {<span style="color: #528B8B;">"acteurs"</span>: <span style="color: #528B8B;">"Matthias Schoenaerts"</span>}}
)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b19f4b" class="outline-2">
<h2 id="org2b19f4b">Opgave 14</h2>
<div class="outline-text-2" id="text-org2b19f4b">
<p>
Voeg het volgende document toe aan de collectie films:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">naam:</td>
<td class="org-left">De Premier</td>
</tr>

<tr>
<td class="org-left">jaar:</td>
<td class="org-left">2016</td>
</tr>

<tr>
<td class="org-left">acteurs:</td>
<td class="org-left">Koen De Bouw, Tine Reymer</td>
</tr>

<tr>
<td class="org-left">director:</td>
<td class="org-left">Erik Van Looy</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-mongo">db.films.insertOne({
  <span style="color: #528B8B;">"naam"</span>: <span style="color: #528B8B;">"De Premier"</span>, 
  <span style="color: #528B8B;">"jaar"</span>: 2016, 
  <span style="color: #528B8B;">"acteurs"</span>: [<span style="color: #528B8B;">"Koen De Bouw"</span>, <span style="color: #528B8B;">"Tine Reymer"</span>],
  <span style="color: #528B8B;">"director"</span>: <span style="color: #528B8B;">"Erik Van Looy"</span>
})
</pre>
</div>
</div>
</div>

<div id="outline-container-org38f51d4" class="outline-2">
<h2 id="org38f51d4">Opgave 15</h2>
<div class="outline-text-2" id="text-org38f51d4">
<p>
Wijzig alle documenten waarin Erik Van Looy director is. <br />
Voeg een kenmerk toe: genre: thriller 
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.films.update(
  {<span style="color: #528B8B;">"director"</span>: <span style="color: #528B8B;">"Eric Van Looy"</span>},
  {$set: {<span style="color: #528B8B;">"genre"</span>: <span style="color: #528B8B;">"thriller"</span>}},
  {multi:<span style="color: #BBAA97;">true</span>}
)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d97002" class="outline-2">
<h2 id="org0d97002">Opgave 16</h2>
<div class="outline-text-2" id="text-org0d97002">
<p>
Maak een collectie boeken. <br />
Voeg een document toe met onderstaande kenmerken:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">_id:</td>
<td class="org-left">A001</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">auteur:</td>
<td class="org-left">Stieg Larsson</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">boek:</td>
<td class="org-left">titel:</td>
<td class="org-left">Mannen die vrouwen haten</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">jaartal:</td>
<td class="org-left">2005</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">titel:</td>
<td class="org-left">De vrouw die met vuur speelde</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">jaartal:</td>
<td class="org-left">2006</td>
</tr>
</tbody>
</table>

<p>
Let op: in het veld boek staan 2 subdocumenten. 
</p>

<div class="org-src-container">
<pre class="src src-mongo">db.boeken.insertOne({
  <span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"A001"</span>,
  <span style="color: #528B8B;">"auteur"</span>: <span style="color: #528B8B;">"Stieg Larsson"</span>,
  <span style="color: #528B8B;">"boek"</span>: [
    {<span style="color: #528B8B;">"titel"</span>: <span style="color: #528B8B;">"Mannen die vrouwen haten"</span>,<span style="color: #528B8B;">"jaartal"</span>: 2005},
    {<span style="color: #528B8B;">"titel"</span>: <span style="color: #528B8B;">"De vrouw die met vuur speelde"</span>,<span style="color: #528B8B;">"jaartal"</span>: 2006}
  ]
})
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcee5029" class="outline-2">
<h2 id="orgcee5029">Opgave 17</h2>
<div class="outline-text-2" id="text-orgcee5029">
<p>
Voeg een document toe met onderstaande kenmerken:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">_id:</td>
<td class="org-left">A002</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">auteur:</td>
<td class="org-left">Wiebe van der Zee, Bert van der Zee</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">boek:</td>
<td class="org-left">titel:</td>
<td class="org-left">Succes met Big Data</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">jaartal:</td>
<td class="org-left">2016</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">uitgeverij:</td>
<td class="org-left">Van Duuren Media B.V.</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-mongo">db.boeken.insertOne({
  <span style="color: #528B8B;">"_id"</span>: <span style="color: #528B8B;">"A002"</span>,
  <span style="color: #528B8B;">"auteur"</span>: [
    <span style="color: #528B8B;">"Wiebe van der Zee"</span>, 
    <span style="color: #528B8B;">"Bert van der Zee"</span>
  ],
  <span style="color: #528B8B;">"boek"</span>: [
    <span style="color: #528B8B;">"titel"</span>: <span style="color: #528B8B;">"Succes met Big Data"</span>,
    <span style="color: #528B8B;">"jaartal"</span>: 2016, 
    <span style="color: #528B8B;">"uitgeverij"</span>: <span style="color: #528B8B;">"Van Duuren Media B.V."</span>
  ]
})
</pre>
</div>
</div>
</div>

<div id="outline-container-org832e4ad" class="outline-2">
<h2 id="org832e4ad">Opgave 18</h2>
<div class="outline-text-2" id="text-org832e4ad">
<p>
Voeg het volgende subdocument toe bij de auteur Stieg Larsson (_id: A001):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">boek:</td>
<td class="org-left">titel:</td>
<td class="org-right">Gerechtigheid</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">jaartal:</td>
<td class="org-right">2007</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-mongo">db.boeken.update(
  {<span style="color: #528B8B;">"auteur"</span>: <span style="color: #528B8B;">"Stieg Larsson"</span>},
  {$addToSet: {
    $push: {
      <span style="color: #528B8B;">"titel"</span>: <span style="color: #528B8B;">"Gerechtigheid"</span>,
      <span style="color: #528B8B;">"jaartal"</span>: 2007
    }
  }}
)
</pre>
</div>
<p>
<a href="../index.html">Home</a> &gt; <a href="mongodb.html">MongoDB</a> &gt; Algemene oefeningen
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Robin Wils</p>
<p class="date">Created: 2019-08-21 Wed 11:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
